{"heros":[
{   
    "id": 1,
    "name": "Batman",
    "bio": "The central fixed event in the Batman stories is the character's origin story.  As a young boy, Bruce Wayne was horrified and traumatized when he watched his parents, the physician Dr. Thomas Wayne and his wife Martha, murdered with a gun by a mugger named Joe Chill. Batman refuses to utilize any sort of gun on the principle that a gun was used to murder his parents. This event drove him to train his body to its peak condition and fight crime in Gotham City as Batman. Pearson and Uricchio also noted beyond the origin story and such events as the introduction of Robin, Until recently, the fixed and accruing and hence, canonized, events have been few in number, a situation altered by an increased effort by later Batman editors such as Dennis O'Neil to ensure consistency and continuity between stories.  In Batman's first appearance in Detective Comics #27, he is already operating as a crime-fighter. Batman's origin is first presented in Detective Comics #33 (November 1939) and is later expanded upon in Batman #47. As these comics state, Bruce Wayne is born to Dr. Thomas Wayne and his wife Martha, two very wealthy and charitable Gotham City socialites. Bruce is brought up in Wayne Manor, and leads a happy and privileged existence until the age of 8, when his parents are killed by a small-time criminal named Joe Chill while on their way home from a movie theater. That night, Bruce Wayne swears an oath to spend his life fighting crime. He engages in intense intellectual and physical training; however, he realizes that these skills alone would not be enough. Criminals are a superstitious cowardly lot, Wayne remarks, so my disguise must be able to strike terror into their hearts. I must be a creature of the night, black, terrible ... As if responding to his desires, a bat suddenly flies through the window, inspiring Bruce to craft the Batman persona.  In early strips, Batman's career as a vigilante earns him the ire of the police. During this period, Bruce Wayne has a fiancé named Julie Madison. In Detective Comics #38, Wayne takes in an orphaned circus acrobat, Dick Grayson, who becomes his vigilante partner, Robin. Batman also becomes a founding member of the Justice Society of America, although he, like Superman, is an honorary member, and thus only participates occasionally. Batman's relationship with the law thaws quickly, and he is made an honorary member of Gotham City's police department. During this time, Alfred Pennyworth arrives at Wayne Manor, and after deducing the Dynamic Duo's secret identities, joins their service as their butler.",
    "image": "https://upload.wikimedia.org/wikipedia/en/8/83/Batman_Detective_Comics_1000_Variant.jpg"
},
{
    "id": 2,
    "name": "Wolverine",
    "bio": "Wolverine was born as James Howlett in northern Alberta, Canada (approximately near Cold Lake), during the late 19th century, purportedly to rich farm owners John and Elizabeth Howlett, though he is actually the illegitimate son of the Howletts' groundskeeper, Thomas Logan. After Thomas is thrown off the Howletts' property for an attempted rape perpetrated by his other son, named simply Dog, he returns to the Howlett manor and kills John Howlett. In retaliation, young James kills Thomas with bone claws that emerge from the back of his hands, as his mutation manifests. He flees with his childhood companion, Rose, and grows into manhood on a mining colony in the Yukon, adopting the name Logan. When Logan accidentally kills Rose with his claws, he flees the colony and lives in the wilderness among wolves, until he is captured and placed in a circus. Saul Creed, brother of Victor Creed, frees Logan, but after he betrays Logan and Clara Creed to Nathaniel Essex, Logan drowns Creed in Essex's potion. Logan returns to civilization, residing with the Blackfoot people. Following the death of his Blackfoot lover, Silver Fox, at the hands of Victor Creed, now known as Sabretooth, he is ushered into the Canadian military during World War I.  During World War II, Logan teams up with Captain America and continues a career as a mercenary. He serves with the 1st Canadian Parachute Battalion during D-Day, and later with the CIA before being recruited by Team X, a black ops unit. Sometime after WWII and before joining Team X, Logan spends time in Madripoor before settling in Japan, where he marries Itsu. While Logan is away from home, Romulus sends the Winter Soldier to kill the pregnant Itsu and has her baby taken from her womb; the boy would later become Daken. Logan believes his son to be dead for many years.  As a member of Team X, Logan is given false memory implants. Eventually breaking free of this mental control, he joins the Canadian Defense Ministry. Logan is subsequently kidnapped by the Weapon X program, where he remains captive and experimented on, until he escapes. It is during his imprisonment by Weapon X that he has adamantium forcibly fused onto his bones. James and Heather Hudson help him recover his humanity following his escape, and Logan begins work as an intelligence operative for the Canadian government's Department H. He becomes Wolverine, one of Canada's first superheroes. In his first mission, he is dispatched to stop the destruction caused by a brawl between the Hulk and the Wendigo.]",
    "image": "https://upload.wikimedia.org/wikipedia/en/5/5d/Wolverine_%28James_%27Logan%27_Howlett%29.png"
},
{
    "id": 3,
    "name": "Storm",
    "bio": "Ever since her inception in 1975, Storm's biography has largely stayed the same. The framework was laid first by Chris Claremont, who fleshed out her backstory in The Uncanny X-Men #102 (1976), #113 (1978) and #117 (1979). Some reinterpretations were made in 2005 and 2006, where writers Mark Sumerak and Eric Jerome Dickey, respectively, rewrote part of her early history in the miniseries Ororo: Before the Storm and Storm vol. 2.  According to established Marvel canon, Ororo Munroe is born in New York City as the child of Kenyan tribal princess N'Dare and American photographer David Munroe. When Ororo is six months old, she and her parents move to the Egyptian capital of Cairo. Five years later, during the Suez Crisis, a fighter jet crashes into her parents' house, killing them. Buried under tons of rubble, Ororo survives but is orphaned and left with intense claustrophobia. Her fear was once so intense that she was known to curl into a fetal position and approach a catatonic state. In late 2000s storylines, however, writers like Ed Brubaker and Christopher Yost have indicated that Storm had largely conquered her claustrophobia, and can freely move in tight spaces, even over long periods of time. After the death of her parents, Ororo wanders Cairo's back-alleys for a few weeks, until she is picked up by the benign street lord Achmed el-Gibar and becomes a prolific thief; among her victims is her future mentor Professor X who is there to meet the Shadow King. Following an inner urge, she wanders into the Serengeti as a teenager and meets T'Challa, who would become her future husband. Despite strong mutual feelings, the two part ways.  In the Serengeti, Ororo first displays her mutant ability to control the weather. Sometime after this, she met the witch-priestess, Ainet, who took her in and became her surrogate mother. Once, when their village was going through a terrible drought, Storm commanded rain for days just to help them. By doing this, she threw off the natural order of nature, and droughts were formed over numerous villages, and hundreds of animals were killed. Sensing the damage she had done, Ainet told Storm that her kind but poorly considered gesture had unintended consequences. Ainet took this opportunity to explain to Ororo how her powers worked with nature, and how she could fix the problem by properly distributing rain.",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/16/Storm_(Marvel_Comics_-_1990s).png"
},
{
    "id": 4,
    "name": "Cyclops",
    "bio": "When Scott was a young boy, his father, USAF Major Christopher Summers, took the family for a flight in their de Havilland Mosquito from his grandparents' home in Anchorage, Alaska, when it came under attack by an alien Shi'ar spaceship. As the plane went down in flames, Scott's parents fastened him and his younger brother Alex into a parachute and pushed them off the plane, hoping that they would survive.  In Cyclops's first appearance in The X-Men #1, he is already leading the X-Men under tutelage of Professor X. Later, Scott's origin is first presented in The Uncanny X-Men #38–42 and later refined in The Uncanny X-Men #144 and The Uncanny X-Men #156. In 2010, Marvel released X-Men Origins: Cyclops #1 that describes the character's childhood through his joining the X-Men.  The early accounts in the X-Men comics use flashbacks to tell the origin story of Scott parachuting from his parents' plane. The flashbacks are often told from various narrative perspectives and place different emphasis on the events of this period. Scott's poor control over his power have been attributed to events in his childhood. In The Uncanny X-Men #156, Scott's parachute caught fire and Scott struck his head upon landing. This caused brain damage to Scott which is responsible for his poor control over his optic blasts.  Several origin stories do not feature the head injury account with X-Men Origins: Cyclops #1 being the most recent. The head injury account has also been retconned in Astonishing X-Men vol. 3 as being due to a self-imposed mental block he made as a child to deal with the traumatic events of his life.  With the help of Emma Frost, Scott is able to briefly bypass his own mental block and control his powers, though he reveals that his control is waning and temporary.  For a time, Scott had prolonged amnesia about his childhood. Parts of his memory returned when he was unexpectedly attacked by the demon D'Spayre while on a leave of absence after Jean Grey's perceived first death. Scott spent most of his childhood at the State Home for the Foundlings in Omaha, Nebraska and was subjected to batteries of tests and experiments by the orphanage's owner, Mr. Milbury, an alias for the geneticist Mister Sinister, who also placed mental blocks on Scott.",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/e9/Cyclops_%28Scott_Summers_circa_2019%29.png"
},
{
    "id": 5,
    "name": "Spawn",
    "bio": "Spawn is Albert Francis Al Simmons. Born in Detroit, Michigan, he is the second oldest of three children born to Bernard Simmons, a traveling salesman, and Esther Simmons, a devil worshipper. Al Simmons is a very intelligent, physically strong, and highly decorated officer in the U.S. Marine Corps, attaining the rank of Lieutenant Colonel while serving with Force Recon. He later joins the Secret Service, becomes a high-ranking official, and is recruited by the Central Intelligence Agency. Simmons later joins the U.S. Security Group, an umbrella agency encompassing the CIA, NSA, and NSC, commanded by Director Jason Wynn, and becomes a capable assassin.  During a mission in Botswana, Wynn grows tired of Simmons' increasing sense of morality. As a result of this, Simmons' friend and partner Bruce Stinson (codename Chapel) is secretly hired to kill him. Simmons is burned to death and sent to Hell.  Making a deal with the devil Malebolgia, Simmons agrees to become a Hellspawn. After swearing to serve Malebolgia, he is allowed to see his wife Wanda one last time. Malebolgia returns Simmons to the living realm with a severely burned body, and a demonic guardian named the Violator. Simmons, now a Hellspawn, returns to Earth with a lack of understanding of his previous identity. He wanders in a state of confusion with only vague memories of his former life, including his own name, his marriage to Wanda and the fact that he was once deceased. Spawn occasionally experiences painful flashbacks and eventually remembers his deal with Malebolgia. Using CIA files, he tracks down his wife and finds her married to his former best friend Terry, with whom she has a daughter named Cyan. He realizes five years have passed since his death.  Spawn runs into a fellow Hellspawn, who informs him that his powers are fueled by Necroplasm and that once they are depleted, he will return to Hell. Not wanting to return to Hell, Spawn attempts to find a new purpose in life while using as little power as possible. Spawn is thrust into several antihero adventures, taking down street gangs and organized crime in New York City. Battling against various criminals, Spawn finds a new purpose in stopping evil.",
    "image": "https://upload.wikimedia.org/wikipedia/en/d/d9/Spawn_Classic.jpg"
},
{
    "id": 6,
    "name": "Deadpool",
    "bio": "Deadpool is aware that he is a fictional comic book character. He commonly breaks the fourth wall, which is done by few other characters in the Marvel Universe, and this is used to humorous effect, for instance, by having Deadpool converse with his own inner monologue, represented by caption boxes. In stories by writer Daniel Way between 2008 and 2012, Deadpool was, without explanation, shown to have developed a second voice in his head, represented by a second set of captions with a different font; Deadpool vol. 3 Annual #1 (2014) would retroactively explain that this voice belonged to Madcap, a psychotic Captain America villain, who had become molecularly entangled with Deadpool. The character's back-story has been presented as vague and subject to change, and within the narrative, he is unable to remember his personal history due to a mental condition. Whether or not his name was even Wade Wilson is subject to speculation since one of his nemeses, T-Ray, claims in Deadpool #33 that he is the real Wade Wilson and that Deadpool is a vicious murderer who stole his identity. There have been other dubious stories about his history—at one point the supervillain Loki claimed to be his father. Frequently, revelations are later retconned or ignored altogether, and in one issue, Deadpool himself joked that whether or not he is actually Wade Wilson depends on which writer the reader prefers.  Deadpool is depicted as having a regenerative healing factor, which not only prevents him from being permanently injured through enhanced cell regeneration throughout his body, but also causes psychosis and mental instability, as his neurons are also affected by the accelerated regeneration. It is thought that while his psychosis is a handicap, it is also one of his assets as they make him an extremely unpredictable opponent. Taskmaster, who has photo-reflexive memory which allows him to copy anyone's fighting skills by observation, was unable to defeat Deadpool due to his chaotic and improvised fighting style. Taskmaster has also stated that Deadpool is an expert at distracting his opponents.",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/ca/Deadpool.png"
},
{
    "id": 7,
    "name": "Angela",
    "bio": "Angela is an angel and a bounty hunter, working under the auspices of Heaven to oppose Spawn. She attempts to kill Spawn upon their first meeting, but is defeated despite her significantly greater experience. Later, he comes to her aid during her trial in Heaven, where he testifies that she had permission to kill him. They are temporarily trapped in a pocket dimension when Spawn's cloak acts to protect him from her weapons. Spawn's restructuring of reality allows them to return from the pocket dimension, and also erases Angela's 'permit' to use her weapons against him. While returning to Earth they start a romantic relationship. However, Angela is killed during the battle with Malebolgia. Spawn returns her body to the angels, who presumably bring her back to life.  The Guardians of the Galaxy and Angela are attacked in warp space by a band of pirates, called Warpjackers. During the battle, Angela abandons the Guardians when the adult Loki telepathically tells her that the portal to Heven is open and that she can return home. As Thor battles Heven's guards, Angela appears having been guided to the doorway to Heven by Loki, and prepares to battle Thor. Angela fights an exhausted Thor who had just fought off the army of Heven, and is then told by the Queen of Angels to bring Thor to her. The now-female Loki has aligned with the Angels, telling Thor that being on the winning side seems just perfect.  While Loki leads an Angel fleet to Asgard, under the false pretence to help them destroy it, Thor escapes captivity and engages Angela in combat once again.  The fight between Thor and Angela is interrupted when Odin (who Loki freed from his self-exile) arrives and recognizes Angela as his daughter, revealing Angela's true lineage as the long thought dead Aldrif. A long time ago, the Angel tasked to dispose of Aldrif's body found out the baby was alive and raised her as one of the Angels under the name of Angela. In light of this revelation, the Queen of Angels grants Angela her life, pardoning her for her service to the Angels, but exiles her from Heven due to her lineage. After leaving Heven, Odin tells Thor, Loki, and Angela that he still loves his children. Angela then decides to leave in order to explore the other realms.  Later, Angela and her lover Sera abduct the newborn daughter of Odin and Freyja. Unbeknownst to Odin, the baby is possessed by the spirit of Surtur and Odin orders Thor to hunt down the pair. Angela and Sera with help from the Guardians of the Galaxy, stay ahead of Thor and take the baby to Heven to be cleansed of Surtur's spirit. There, Angela throws the baby into the stalled engines of Heven. Surtur's fire is expelled from the baby and reignites the engines of Heven. For this action, Angela's debt to Heven is repaid and thus closes her last remaining connection to the realm.",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/e2/Angelamarveluniverse.jpg"
},
{
    "id": 8,
    "name": "Venom",
    "bio": "The Venom symbiote's first human host was Spider-Man himself, who eventually discovered its true nefarious nature and separated himself from the creature in The Amazing Spider-Man #258 (November 1984)—with a brief rejoining five months later in Web of Spider-Man #1. The symbiote went on to merge with other hosts, beginning with Eddie Brock, its second and best-known host, with whom it first became Venom. Venom has endured as one of Spider-Man's most prominent villains, and was initially regarded as one of his three archenemies, alongside the Green Goblin and Doctor Octopus. Since his debut however, Venom has evolved into an antiheroic figure, slowly distancing himself from his initial goal to ruin Spider-Man's life to try and do good instead, even putting aside his differences with and helping Spider-Man at times. After Brock, numerous other hosts for Venom followed; some of the most notable are the villain Mac Gargan, who was the main incarnation of Venom from 2005 to 2009, and Flash Thompson, who became the superhero Agent Venom from 2011 to 2016, before Venom returned to Brock in 2017. Venom's most recent and current host is Brock's biological son, Dylan. Venom is also depicted as having spawned several children—Scream, Lasher, Phage, Agony, Riot, Mania, Sleeper, and most notably, Carnage, who becomes Venom's archenemy after being bound to serial killer Cletus Kasady.",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/ff/Web_of_Venom.png"
},
{
    "id": 9,
    "name": "Bishop",
    "bio": "Born about 80 years in the future of the Marvel Universe, Bishop was the son of Aboriginal mutant refugees who fled to America from Australia one day before Australia was devastated by a nuclear attack.  He was raised in a mutant concentration camp in the aftermath of the Summers Rebellion, an uprising in which mutants and humans joined forces to destroy the Sentinels. Bishop has a distinctive M brand over his right eye, used to identify mutants in his era. After his parents were killed, Bishop was taken in by a man named LeBeau, also called Witness, who was reportedly the last man to see the legendary X-Men alive. According to LeBeau, Bishop's adoptive grandmother took Bishop away from him. Bishop and his younger sister, Shard, were then subsequently raised by his grandmother within the same mutant concentration camp in Brooklyn.  Bishop's grandmother taught him many legends of the X-Men, who were old allies of hers. Depowered by unknown means, she had entered the camps in secret to raise her grandchildren. Upon her deathbed, she made Bishop swear to protect Shard. After the Rebellion, the mutants were emancipated and sent out of the camps to fend for themselves. Bishop and Shard, who were only children, were left alone. They lived on the streets, stealing to survive until coming under the care of a family friend, a war veteran named Hancock. Slightly blind, Hancock nevertheless took on the task of raising the two.  One day, Bishop encountered an anti-human group of mutants called the Exhumes, who took Shard hostage just before the XSE arrived. Until that time, Bishop had admired the Exhumes, attributing to them his proud, idealized notion of the legendary X-Men. It wasn't until the XSE defeated the Exhume and saved his sister that Bishop knew he wanted to join the XSE. When Bishop was 15, Hancock was murdered by criminals who were promptly arrested by the XSE, and he and Shard enlisted in their ranks. Shard soon surpassed Bishop to become the youngest XSE officer.",
    "image": "https://upload.wikimedia.org/wikipedia/en/3/32/Lucas_Bishop_X-Men.png"
}
]
}